# Taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Terminal apps
brew "asdf"            # General dependency version manager (https://asdf-vm.com)
brew "curl"            # To get newest version available.
brew "exa"             # Modern replacement for `ls`. (https://github.com/ogham/exa)
brew "bat"             # Improvement to cat which is aliased to this.
brew "fzf"             # Fuzzy finder. (https://github.com/junegunn/fzf)
brew "git"             # To get newest version available.
brew "gh"              # GitHub CLI. (https://cli.github.com)
brew "gum"             # A tool for glamorous shell scripts. (https://github.com/charmbracelet/gum)
brew "jless"           # CLI JSON viewer tool. (https://jless.io)
brew "lazydocker"      # CLI TUI docker manager (https://github.com/jesseduffield/lazydocker)
brew "lazygit"         # CLI TUI git manager (https://github.com/jesseduffield/lazygit)
brew "mas"             # Mac App Store installer CLI for `mas` steps below.
brew "mosh"            # Mobile shell (https://mosh.org/)
brew "nmap"            # Network utility. (https://nmap.org)
brew "rcm"             # rc file (dotfiles) helper. (https://thoughtbot.github.io/rcm/rcm.7.html)
brew "rsync"           # Newer version of filesystem sync tool.
brew "ssh-copy-id"     # Utility for copying SSH keys to remote servers.
brew "tmux"            # Terminal window manager.
brew "tree"            # Generate directory tree schema. (http://mama.indstate.edu/users/ice/tree/)
brew "vim"             # To get newest version available.
brew "wget"            # Utility for retrieving files.
brew "ykman"           # YubiKey manager CLI (https://developers.yubico.com/yubikey-manager/)
brew "youtube-dl"      # YouTube downloading utility.
brew "z"               # Quickly go to common directories
brew "zsh"             # To get newest version available
brew "zellij"          # tmux alternative for terminal panes (https://zellij.dev/)


# Mac App Store apps
mas "Airmail", id: 918858936
mas "Bear", id: 1091189122
mas "Pixelmator Pro", id: 1289583905
mas "Soulver 3", id: 1508732804
mas "Things", id: 904280696
mas "Wireguard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
# mas "com.agilebits.onepassword-osx", id: 1333542190 # 1Password
mas "iA Writer", id: 775737590

# Cask Mac apps
cask "1password"             # Prefer non-App Store version
cask "alfred"                # Used instead of Spotlight (and also offers a clipboard history)
cask "firefox"               # Browser
cask "iterm2"                # Better terminal
cask "sourcetree"            # Git GUI
cask "slack"                 # Work messaging app
cask "signal"                # Messaging app
cask "visual-studio-code"    # Text editor

# Fonts
cask "font-fira-code"
