# Taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Terminal apps
brew "fzf"             # Fuzzy finder. (https://github.com/junegunn/fzf)
brew "gh"              # GitHub CLI. (https://cli.github.com)
brew "gum"             # A tool for glamorous shell scripts. (https://github.com/charmbracelet/gum)
brew "jless"           # CLI JSON viewer tool. (https://jless.io)
brew "lazydocker"      # CLI TUI docker manager (https://github.com/jesseduffield/lazydocker)
brew "lazygit"         # CLI TUI git manager (https://github.com/jesseduffield/lazygit)
brew "mas"             # Mac App Store installer CLI for `mas` steps below.
brew "ssh-copy-id"     # Utility for copying SSH keys to remote servers.
brew "ykman"           # YubiKey manager CLI (https://developers.yubico.com/yubikey-manager/)
brew "youtube-dl"      # YouTube downloading utility.
brew "z"               # Quickly go to common directories
brew "zellij"          # tmux alternative for terminal panes (https://zellij.dev/)


# Mac App Store apps
mas "Soulver 3", id: 1508732804
mas "Things", id: 904280696
mas "Yubico Authenticator", id: 1497506650

# Cask Mac apps
cask "1password"             # Prefer non-App Store version
cask "alfred"                # Used instead of Spotlight (and also offers a clipboard history)
cask "firefox"               # Browser
cask "slack"                 # Work messaging app
cask "signal"                # Messaging app
cask "visual-studio-code"    # Text editor

# Fonts
cask "font-fira-code"
