# Taps
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Terminal apps
brew "asdf" # General dependency version manager (https://asdf-vm.com)
brew "bat" # improvement to cat which is aliased to this.
brew "fzf" # fuzzy finder
brew "gh" # github cli
brew "mas" # Mac App Store installer CLI
brew "mosh" # Mobile shell (https://mosh.org/)
brew "rcm" # dotfiles helper
brew "tmux"
brew "tree"
brew "wget"
brew "vim" # To get newest version available
brew "yarn"
brew "ykman" # YubiKey manager CLI (https://developers.yubico.com/yubikey-manager/)
brew "youtube-dl"
brew "z" # Quickly go to common directories
brew "zsh"

# Mac App Store apps
mas "com.agilebits.onepassword-osx", id: 443987910 # 1Password
mas "Bear", id: 1091189122 # Bear
mas "Pixelmator Pro", id: 1289583905
mas "Things", id: 904280696
mas "Yubico Authenticator", id: 1497506650

# Cask Mac apps
cask "alfred"
cask "iterm2"
cask "slack"

# Fonts
cask "font-fira-code"
